## "Обработка списка фруктов"

### Задание

Дан файл [data/fruits.txt](data/fruits.txt) со списком фруктов. \
Записать в новые файлы все фрукты, начинающиеся с определенной буквы. \
Т.е. в одном файле будут все фрукты на букву “А”, во втором на “Б” и т.д. \
Файлы назвать соответственно.
Пример имен файлов: fruits_А.txt, fruits_Б.txt, fruits_В.txt …. \
Важно! Обратите внимание, что нет фруктов, начинающихся с некоторых букв, а также есть пустые строки, которые нужно пропустить. \
**Не гарантируется**, что фрукты идут по алфавиту. Т.е. сначала может быть фрукт на букву "В", а потом идти на букву "Б" \
Напишите универсальный код, который будет работать с любым списком фруктов и распределять по файлам в зависимости от первых букв, имеющихся в списке фруктов.

### Формат входных данных

Дан текстовый файл, на каждой строке которого или название фрукта, или пустая строка.

### Формат выходных данных

Записать названия фруктов в разные файлы в соответствии с условием задачи.

### Решение задачи

```python
path = "data/fruits.txt"
alphabet = list(map(chr, range(ord('А'), ord('Я')+1)))

with open(path, "r", encoding="utf-8") as f_in:
    for line in f_in:
        fruit = line.strip()
        if len(fruit) != 0 and fruit.upper()[0] in alphabet:
            path_out = path.replace(".", fruit.upper()[0] + ".")
            with open(path_out, "a", encoding="utf-8") as f_out:
                f_out.write(fruit + "\n")
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Возможно пригодится:

Чтобы получить список больших букв русского алфавита:
```python
print(list(map(chr, range(ord('А'), ord('Я')+1))))
```

</details>
