# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

# TODO: your code here
max_length_fruit_name = max(map(len, fruits))
max_length_index = len(str(len(fruits)))

i = 1
for fruit in fruits:
    print(str(i).rjust(max_length_index) + ".", fruit.rjust(max_length_fruit_name))
    i += 1

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
