## "Бесконечный ввод и подсчет положительных"

### Задание

С клавиатуры вводятся целые числа, до тех пор пока не будет введена строка "стоп". \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Вводятся целые числа, пока не будет введено "стоп".

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
s = "0"
count_positive = 0
i = 1
while s != "стоп":
    if int(s) > 0:
        count_positive += 1
    s = input("Введите целое число (для выхода из цикла наберите \"стоп\") ")
    i += 1
print("Количество положительных чисел равно ", count_positive)
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Выполнение цикла пока не будет введено нужное значение"
</details>
