## "Все совершенные число в диапазоне"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Найдите все совершенные числа и их количество в заданном диапазоне [a, b].

### Формат входных данных

Даны два целых положительных числа, границы диапазона. Гарантируется, что a < b.

### Формат выходных данных

Вывести все совершенные числа, а затем их количество.

### Решение задачи

```python
a = int(input("Введите первое целое положительное число: "))
b = int(input("Введите второе целое положительное число, больше первого: "))

s = ""
n = a

while n <= b:
    divider = 1
    is_simple = False  # Признак простого числа
    sum_dividers = 0
    while divider < n:
        if divider > (n // 2 + 1) and sum_dividers == 0:
            is_simple = True  # Число простое, если не найден делитель от 1 до n //2 +1
            break
        if n % divider == 0:
            sum_dividers += divider
        divider += 1
    if not is_simple and n == sum_dividers:
        s += str(n) + " "
    n += 1

if s != "":
    print("Совершенные числа:", s)
else:
    print("Совершенных чисел нет.")
```

---

### Подсказки
<details>
<summary>Подсказка-1</summary>
Для решения задачи вам понадобятся вложенные циклы.

```python
while ...:  # внешний цикл
    while ...:  # внутренний цикл
        ...
```
Внешний цикл будет перебирать числа из диапазона, а внутренний проверять, является ли число совершенным.
</details>

<details>
<summary>Подсказка-2</summary>
Для проверки числа на совершенность, воспользуйтесь решение предыдущей задачи "Совершенное число".
</details>
