## "Совершенное число"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Проверить, является ли данное число совершенным.

### Формат входных данных

Дано целое положительно число.

### Формат выходных данных

Вывести "Да", если число совершенно и "Нет" в противоположном случае.

### Решение задачи

```python
n = int(input("Введите целое положительное число: "))
divider = 1
is_simple = False  # Признак простого числа
sum_dividers = 0

while divider < n:
    if divider > (n // 2 + 1) and sum_dividers == 0:
        is_simple = True  # Число простое, если не найден делитель от 1 до n //2 +1
        break
    if n % divider == 0:
        sum_dividers += divider
    divider += 1

if is_simple:
    print("Число простое")
else:
    print("Да" if n == sum_dividers else "Нет")

```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    4    | Нет |
|    6    | Да  |
|    14    | Нет |
|    22    | Нет |
|    28    | Да  |
|    100    | Нет  |
|    496   | Да  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Воспользуйтесь решение предыдущей задачи "Делители числа" и найдите их сумму.
</details>
